---
kind: method
id: M:Autodesk.Revit.DB.Structure.StructuralSections.StructuralElementDefinitionData.Dispose
source: html/5933b18e-4bda-ca25-8ea4-65e7ef28700a.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralElementDefinitionData.Dispose Method

Releases all resources used by the StructuralElementDefinitionData

## Syntax (C#)
```csharp
public void Dispose()
```